hangcui1201/DSP_TI_TMS320F28379D/F28379D_Projects/libraries/boot_rom/f2838x/rev0/rom_sources/cpu2/F2838x_ROM/inc/hw_epwmxbar.h
//*****************************************************************************
//
// The following are defines for the bit fields in the TRIPOUTINV register
//
//*****************************************************************************
#define XBAR_TRIPOUTINV_TRIP4     0x1U         // Selects polarity for TRIP4 of
                                               // EPWM-XBAR
#define XBAR_TRIPOUTINV_TRIP5     0x2U         // Selects polarity for TRIP5 of
                                               // EPWM-XBAR
#define XBAR_TRIPOUTINV_TRIP7     0x4U         // Selects polarity for TRIP7 of
                                               // EPWM-XBAR
#define XBAR_TRIPOUTINV_TRIP8     0x8U         // Selects polarity for TRIP8 of
                                               // EPWM-XBAR
#define XBAR_TRIPOUTINV_TRIP9     0x10U        // Selects polarity for TRIP9 of
                                               // EPWM-XBAR
#define XBAR_TRIPOUTINV_TRIP10    0x20U        // Selects polarity for TRIP10
                                               // of EPWM-XBAR
#define XBAR_TRIPOUTINV_TRIP11    0x40U        // Selects polarity for TRIP11
                                               // of EPWM-XBAR
#define XBAR_TRIPOUTINV_TRIP12    0x80U        // Selects polarity for TRIP12
                                               // of EPWM-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the TRIPLOCK register
//
//*****************************************************************************
#define XBAR_TRIPLOCK_LOCK        0x1U         // Locks the configuration for
                                               // EPWM-XBAR
#define XBAR_TRIPLOCK_KEY_S       16U
#define XBAR_TRIPLOCK_KEY_M       0xFFFF0000U  // Write protection KEY
#endif
